In [63]:
import pandas as pd

In [64]:
s = pd.Series([1,2,5,6,9])

In [65]:
s

0    1
1    2
2    5
3    6
4    9
dtype: int64

In [66]:
s.size

5

In [67]:
s + 9

0    10
1    11
2    14
3    15
4    18
dtype: int64

In [68]:
s2 = pd.Series( [1,9,12, 18], index=['XM', 'XH', 'DT', 'MM'])

In [69]:
s2

XM     1
XH     9
DT    12
MM    18
dtype: int64

In [70]:
s2['XH']

9

In [71]:
s2[0]

1

In [72]:
# Mutiple columns selected
s2[ ['XH', 'MM'] ]

XH     9
MM    18
dtype: int64

In [73]:
# Init using a dict

In [74]:
dct = {
    'Name1': 'XiaoM',
    'Gender': 'M',
    'Age':    26
}

In [75]:
dct

{'Name1': 'XiaoM', 'Gender': 'M', 'Age': 26}

In [76]:
s3 = pd.Series(dct)

In [77]:
s3

Name1     XiaoM
Gender        M
Age          26
dtype: object

In [78]:
s3['Gender']

'M'

In [79]:
s3['Age']

26

In [80]:
dct2 = {
    'name': ['Li2', 'Ma3', 'Zh4'],
    'gender': ['M', 'F', 'M'],
    'age': [22,32,38]
}

In [81]:
dct2

{'name': ['Li2', 'Ma3', 'Zh4'], 'gender': ['M', 'F', 'M'], 'age': [22, 32, 38]}

In [82]:
ds2 = pd.Series(dct2)

In [83]:
ds2

name      [Li2, Ma3, Zh4]
gender          [M, F, M]
age          [22, 32, 38]
dtype: object

In [84]:
#Dataframe

In [85]:
df =  pd.DataFrame(dct2)

In [86]:
df

  name gender  age
0  Li2      M   22
1  Ma3      F   32
2  Zh4      M   38

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   gender  3 non-null      object
 2   age     3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [88]:
df.age.astype('str')

0    22
1    32
2    38
Name: age, dtype: object

In [89]:
df

  name gender  age
0  Li2      M   22
1  Ma3      F   32
2  Zh4      M   38

In [90]:
df[ ['name', 'age']]

  name  age
0  Li2   22
1  Ma3   32
2  Zh4   38

In [91]:
df.name

0    Li2
1    Ma3
2    Zh4
Name: name, dtype: object

In [92]:
df.age

0    22
1    32
2    38
Name: age, dtype: int64

In [93]:
df.age[0]

22

In [94]:
df.name[1]

'Ma3'

In [95]:
df.iloc[0]

name      Li2
gender      M
age        22
Name: 0, dtype: object

In [96]:
df[0:2]

  name gender  age
0  Li2      M   22
1  Ma3      F   32

In [97]:
df[:]

  name gender  age
0  Li2      M   22
1  Ma3      F   32
2  Zh4      M   38

df.age

In [98]:
df.age

0    22
1    32
2    38
Name: age, dtype: int64

In [99]:
df.age

0    22
1    32
2    38
Name: age, dtype: int64

In [101]:
df['age'] = [60, 70, 90]

In [102]:
df

  name gender  age
0  Li2      M   60
1  Ma3      F   70
2  Zh4      M   90

In [103]:
df['AGE'] = [102, 108, 180]

In [104]:
df

  name gender  age  AGE
0  Li2      M   60  102
1  Ma3      F   70  108
2  Zh4      M   90  180

In [105]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [110]:
df[ df.age > 65]

  name gender  age   AGE
1  Ma3      F   70  None
2  Zh4      M   90  None

In [111]:
df.age > 65

0    False
1     True
2     True
Name: age, dtype: bool

In [113]:
df [ df.gender == 'M']

  name gender  age   AGE
0  Li2      M   60  None
2  Zh4      M   90  None

In [117]:
df[ (df.gender == 'M') & (df.age > 80)  ]

  name gender  age   AGE
2  Zh4      M   90  None

In [121]:
df.query( 'gender == "M"' )

  name gender  age   AGE
0  Li2      M   60  None
2  Zh4      M   90  None

In [134]:
df.query( ' (gender != "M") and (age < 80)')

  name gender  age   AGE
1  Ma3      F   70  None

In [128]:
# index

In [131]:
df

  name gender  age   AGE
0  Li2      M   60  None
1  Ma3      F   70  None
2  Zh4      M   90  None

In [129]:
df.iloc[1]

name       Ma3
gender       F
age         70
AGE       None
Name: 1, dtype: object

In [130]:
df.iloc[[0,2]]

  name gender  age   AGE
0  Li2      M   60  None
2  Zh4      M   90  None

In [132]:
df.loc[1]

name       Ma3
gender       F
age         70
AGE       None
Name: 1, dtype: object

In [135]:
#drop column

In [136]:
df

  name gender  age   AGE
0  Li2      M   60  None
1  Ma3      F   70  None
2  Zh4      M   90  None

In [162]:
df['NewCol'] = ['US','AU','EU']

In [163]:
df

  name gender  age   AGE NewCol
0  Li2      M   60  None     US
1  Ma3      F   70  None     AU
2  Zh4      M   90  None     EU

In [164]:
df.drop('NewCol', axis=1)
# axis = 1 denotes column

  name gender  age   AGE
0  Li2      M   60  None
1  Ma3      F   70  None
2  Zh4      M   90  None

In [165]:
df
# you can see that the original dataframe column is not actually dropped

  name gender  age   AGE NewCol
0  Li2      M   60  None     US
1  Ma3      F   70  None     AU
2  Zh4      M   90  None     EU

In [166]:
del df['NewCol']
#use del, you can delete a column from dataframe

In [167]:
df

  name gender  age   AGE
0  Li2      M   60  None
1  Ma3      F   70  None
2  Zh4      M   90  None